Revit 2017 API
TaskDialogIcon Enumeration
 Standard icons to be used in the task dialog.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2011
Syntax
C#
public enum TaskDialogIcon
Visual Basic
Public Enumeration TaskDialogIcon
Visual C++
public enum class TaskDialogIcon
Members
Member name | Description
TaskDialogIconNone | No icon.
TaskDialogIconWarning | Warning icon.
See Also
Autodesk.Revit.UI Namespace